/*
 * Copyright 2025 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
rule rdp_connection_to_unc5837_c2_elevate2025 {
  meta:
    author = "Google Cloud Security (Original: Google Threat Intelligence Group, Adapted by Cline)"
    description = "Detects network connections (potentially RDP) to domains associated with UNC5837 C2 infrastructure used in the 'Rogue RDP' campaign."
    rule_id = "mr_0d9a2b1c-7e5f-4a3b-8c1d-6f9e8a7b0c2d"
    rule_name = "RDP Connection to UNC5837 C2 Domain"
    tactic = "TA0011" // Command and Control
    technique = "T1071.001" // Application Layer Protocol: Web Protocols 
    type = "alert"
    data_source = "network logs, firewall logs, EDR network events"
    severity = "Critical"
    priority = "Critical"
    reference = "https://www.virustotal.com/gui/collection/report--25-10015981"

  events:
    $conn.metadata.event_type = "NETWORK_CONNECTION"
    (
      $conn.target.domain.name = "eu-southeast-1-aws.govtr.cloud" or
      $conn.target.domain.name = "eu-north-1-aws.ua-gov.cloud" or
      $conn.target.domain.name = /eu-southeast-1-aws\[\.\]govtr\[\.\]cloud/ or
      $conn.target.domain.name = /eu-north-1-aws\[\.\]ua-gov\[\.\]cloud/
    )

  outcome:
    $risk_score = 95
    $principal_hostname = array_distinct($conn.principal.hostname)
    $principal_ip = array_distinct($conn.principal.ip)
    $target_domain_name = array_distinct($conn.target.domain.name)
    $target_ip = array_distinct($conn.target.ip)
    $target_port = array_distinct($conn.target.port)
    $principal_process_command_line = array_distinct($conn.principal.process.command_line)
    $principal_process_pid = array_distinct($conn.principal.process.pid)
    $principal_user_userid = array_distinct($conn.principal.user.userid)
    $event_count = count_distinct($conn.metadata.id)

  condition:
    $conn
}
