/*
 * Copyright 2025 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
rule mr_stealc_v2_c2_communication {
  meta:
    author = "Google Cloud Security"
    description = "Detects STEALC.V2 malware C2 communication based on HTTP resource and JSON patterns."
    rule_id = "mr_b47e2bc7-8224-45c4-a0bc-24bef83d20a1"
    rule_name = "STEALC.V2 C2 Communication"
    severity = "Medium"
    priority = "Medium"
    type = "hunt"
    data_source = "microsoft sysmon, zeek http, custom http logs"
    reference = "https://www.virustotal.com/gui/collection/report--25-10026187/summary"
    malware_family = "STEALC"
    malware_name = "STEALC.V2"
    tactic = "TA0011" // Command and Control
    technique = "T1071.001" // Application Layer Protocol: Web Protocols

  events:
    $e.metadata.event_type = "NETWORK_HTTP"
    $e.network.http.url = "/3d15e67552d448ff.php"
    $e.network.http.method = "POST"

    // Look for specific JSON patterns in the HTTP payload
    $e.network.http.body.raw_data contains "\"type\":\"create\"" or
    $e.network.http.body.raw_data contains "\"type\":\"upload_file\"" or
    $e.network.http.body.raw_data contains "\"type\":\"loader\"" or
    $e.network.http.body.raw_data contains "\"type\":\"done\""

  outcome:
    $risk_score = 65
    $c2_ip = array_distinct($e.network.http.target.ip)
    $http_resource = array_distinct($e.network.http.url)
    $principal_hostname = array_distinct($e.principal.hostname)
    $principal_ip = array_distinct($e.principal.ip)
    $principal_user_userid = array_distinct($e.principal.user.userid)
    $target_process_command_line = array_distinct($e.principal.process.command_line)

  condition:
    $e
}
